app/views/matriculas/_form.html.erb

SELECT "alunos".* FROM "alunos"
---
    <div class="col-lg-10">
      <%= f.collection_select(:aluno_id, Aluno.all, :id, :nome, {include_blank: true}, :class => 'form-control' ) %>

SELECT "cursos".* FROM "cursos"
---
    <div class="col-lg-10">
      <%= f.collection_select(:curso_id, Curso.all, :id, :nome, {include_blank: true}, :class => 'form-control') %>