app/controllers/alunos_controller.rb

  def index
    @alunos = Aluno.all
---
SELECT "alunos".* FROM "alunos" WHERE (nome like '%teste%')

  def create
    @aluno = Aluno.new(aluno_params)

    respond_to do |format|
      if @aluno.save
---
INSERT INTO "alunos" ("cpf", "rg", "data_nascimento", "nome", "telefone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @aluno.update(aluno_params)
---
UPDATE "alunos" SET "cpf" = $1, "updated_at" = $2 WHERE "alunos"."id" = $3  [["cpf", "02944492055"], ["updated_at", "2016-09-29 21:09:59.499854"], ["id", 9]]

  def destroy
    @aluno.destroy
---
DELETE FROM "alunos" WHERE "alunos"."id" = $1  [["id", 1]]

    def set_aluno
      @aluno = Aluno.find(params[:id])
---
SELECT  "alunos".* FROM "alunos" WHERE "alunos"."id" = $1 LIMIT 1  [["id", 9]]