app/controllers/buscas_controller.rb

SELECT "alunos".* FROM "alunos" WHERE "alunos"."id" IN (19, 20)
SELECT "cursos".* FROM "cursos" WHERE "cursos"."id" IN (7)
SELECT "matriculas".* FROM "matriculas"
---
  def index
    @q = Matricula.ransack(params[:q])
    @matriculas = @q.result.includes(:aluno, :curso)