app/controllers/cursos_controller.rb

SELECT "cursos".* FROM "cursos" WHERE (nome like '%Tamara%')
---
  def index
    @cursos = Curso.all

INSERT INTO "cursos" ("nome", "valor_inscricao", "periodo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "Tamara Carlos"], ["valor_inscricao", "2.0"], ["periodo", 1], ["created_at", "2016-09-29 20:25:55.294833"], ["updated_at", "2016-09-29 20:25:55.294833"]]
---
  def create
    @curso = Curso.new(curso_params)

    respond_to do |format|
      if @curso.save

DELETE FROM "cursos" WHERE "cursos"."id" = $1  [["id", 2]]
---
  def destroy
    @curso.destroy

SELECT  "cursos".* FROM "cursos" WHERE "cursos"."id" = $1 LIMIT 1  [["id", 7]]
---
    def set_curso
      @curso = Curso.find(params[:id])