app/controllers/matriculas_controller.rb

SELECT "alunos".* FROM "alunos" WHERE "alunos"."id" IN (19, 20)
SELECT "cursos".* FROM "cursos" WHERE "cursos"."id" IN (7)
SELECT "matriculas".* FROM "matriculas" WHERE "matriculas"."aluno_id" = $1  [["aluno_id", 1]]
---
  def index
   @q = Matricula.ransack(params[:q])
   @matriculas = @q.result.includes(:aluno, :curso)

INSERT INTO "matriculas" ("aluno_id", "curso_id", "data_matricula", "ano", "ativo", "pago", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @matricula = Matricula.new(matricula_params)

    respond_to do |format|
      if @matricula.save

UPDATE "matriculas" SET "ano" = $1, "ativo" = $2, "updated_at" = $3 WHERE "matriculas"."id" = $4  [["ano", 2000], ["ativo", 0], ["updated_at", "2016-10-06 12:50:57.190936"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @matricula.update(matricula_params)

DELETE FROM "matriculas" WHERE "matriculas"."id" = $1  [["id", 1]]
---
  def destroy
    @matricula.destroy

SELECT  "matriculas".* FROM "matriculas" WHERE "matriculas"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_matricula
      @matricula = Matricula.find(params[:id])