app/controllers/pagamentos_controller.rb

  def index
    @pagamentos = Pagamento.all
---
SELECT "pagamentos".* FROM "pagamentos"

  def create
    @pagamento = Pagamento.new(pagamento_params)

    respond_to do |format|
      if @pagamento.save
---
INSERT INTO "pagamentos" ("dinheiro", "curso_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dinheiro", "1224.0"], ["curso_id", 7], ["created_at", "2016-10-09 19:43:59.908301"], ["updated_at", "2016-10-09 19:43:59.908301"]]

  def destroy
    @pagamento.destroy
---
DELETE FROM "pagamentos" WHERE "pagamentos"."id" = $1  [["id", 1]]

    def set_pagamento
      @pagamento = Pagamento.find(params[:id])
---
SELECT  "pagamentos".* FROM "pagamentos" WHERE "pagamentos"."id" = $1 LIMIT 1  [["id", 6]]