app/views/pagamentos/_form.html.erb

    <div class="col-lg-10">
      <%= f.collection_select(:curso_id, Curso.all, :id, :valor_inscricao, {include_blank: true}, :class => 'form-control') %>
---
SELECT "cursos".* FROM "cursos"